# <center><u>Pandas <u> </center>

## 1.[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

resource - https://youtu.be/ymqgwuEM1bQ

<p style='text-align: right;'> 1*4=4 points</p>

Import pandas and numpy with their aliases

In [3]:
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [4]:
import numpy as np
data=[100,200,300,400]

In [5]:
a=pd.Series(data)

Print a, and data type

In [6]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [7]:
a[2]

300

What are the values of index for series a?

<p style='text-align: right;'> 2*4 = 8 points</p>

In [8]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [9]:
a.index = ['c','a','b','d']
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [10]:
a['d']

400

Sort the values wrt to the index and print it

In [11]:
a=a.sort_index()
print(a)

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

<p style='text-align: right;'> 4*2=8 points</p>

In [12]:
b=pd.Series([800,450,100],['e','f','g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [13]:
a=a.append(b)

C:\Users\Suraj\AppData\Local\Temp\ipykernel_6524\1030491723.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a=a.append(b)

In [14]:
print(a)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [15]:
a.sort_index(axis=0,ascending=False)

g    100
f    450
e    800
d    400
c    100
b    300
a    200
dtype: int64

In [16]:
# print index of a

print(a.index)

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

## 2. [Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

Reference:-https://youtu.be/xPgG6_ZFi8Y

<p style='text-align: right;'> 8*2 = 16 points</p>

### Part 1

<p style='text-align: right;'> 5 points</p>

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [17]:
df=pd.DataFrame(a)
df

     0
a  200
b  300
c  100
d  400
e  800
f  450
g  100

Point to ponder! Don't you think series a and dataframe df looks alike? But there must be some difference between them. 
Hey buddy think and write your thoughts below.

In [18]:
# happy to know your comment
# diff is in dataframe output mensioned columnes names as 0 and we can oprate 
# index and colunms 
# in Series we accesing element only on index not columns

<p style='text-align: right;'> 2 + 1*4 = 6 points</p>

What is the shape of the datafarme <br>

In [19]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a' ?

In [20]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [21]:
#head
df.head()

     0
a  200
b  300
c  100
d  400
e  800

In [22]:
#tail
df.tail()

     0
c  100
d  400
e  800
f  450
g  100

Rename the columns of the dataframe as 'points'

<p style='text-align: right;'> 2 points</p>

In [23]:
df.columns = ['points']
df

   points
a     200
b     300
c     100
d     400
e     800
f     450
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

<p style='text-align: right;'> 5 points</p>

In [24]:
#Create fruits array
import numpy as np
dat_arr = np.array(['orange','mango','apple','orange','mango','apple','mango'])
dat_arr

array(['orange', 'mango', 'apple', 'orange', 'mango', 'apple', 'mango'],
      dtype='<U6')

The above output might vary based randomness

In [120]:
#Create series fruits out of fruits array
sr = pd.Series(dat_arr)
sr

0    orange
1     mango
2     apple
3    orange
4     mango
5     apple
6     mango
dtype: object

Change the index of fruits to the index of dataframe df

<p style='text-align: right;'> 5 points</p>

In [122]:
df=pd.DataFrame(dat_arr,['a','b','c','d','e','f','g'])
df

        0
a  orange
b   mango
c   apple
d  orange
e   mango
f   apple
g   mango

Add this fruits series as a new column to the dataframe df with its column name as 'fruits' <br> print the head of the dataframe to verify

In [123]:
df.columns =['fruits']
df.head()

   fruits
a  orange
b   mango
c   apple
d  orange
e   mango

<u>Bonus optional question:</u> <br>
What if we had to changed the index of the dataframe? <br>
Try to add any series to the dataframe with the origianl index (when index of series is not same as to the index of dataframe)

Use series as pd.Series([100,200,300,400,500,600,700]) and try to add it to df with column name Bonus_number.

Bonus marks: 5 points

In [101]:
data=[100,200,300,400,500,600,700]
sr=pd.Series(data,['a','b','c','d','e','f','g'])
df=pd.DataFrame(sr)
df.columns =['Bonus_number']
df

   Bonus_number
a           100
b           200
c           300
d           400
e           500
f           600
g           700

In [ ]:
## its takes series index in datframe 
# not change when we put series in dataframe with original index

### Part 2
Reference:- https://www.youtube.com/watch?v=yPVQZZmheCg

Create a dataframe  d1 where the columns are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

<p style='text-align: right;'> 2*5=10 points</p>

In [32]:
d1=pd.DataFrame({"city":['Chandigarh','Delhi','Kanpur','Channai','Manali'],
                'Temprature':[15,22,20,26,-2]})

Print d1

In [33]:
print(d1)

         city  Temprature
0  Chandigarh          15
1       Delhi          22
2      Kanpur          20
3     Channai          26
4      Manali          -2

What is the shape of d1.

In [34]:
d1.shape

(5, 2)

Set city = d1['city']

In [35]:
Set_city =d1['city']

print city <br>
What is the type of city.

In [36]:
print(Set_city)
print(type(Set_city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Channai
4        Manali
Name: city, dtype: object
<class 'pandas.core.series.Series'>

Create another dataframe d2 where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

<p style='text-align: right;'> 3+2+5 = 10 points</p>

In [37]:
d2=pd.DataFrame({'city':['Banglaru','Coimbatore','Srirangam','Pondicherry'],
                'Temprature':[24,35,36,39]})
d2

          city  Temprature
0     Banglaru          24
1   Coimbatore          35
2    Srirangam          36
3  Pondicherry          39

print the shape of this dataframe

In [38]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [39]:

d3 = pd.concat([d1,d2])
d3

          city  Temprature
0   Chandigarh          15
1        Delhi          22
2       Kanpur          20
3      Channai          26
4       Manali          -2
0     Banglaru          24
1   Coimbatore          35
2    Srirangam          36
3  Pondicherry          39

# fun fact at high level

1. .concat() simply stacks multiple DataFrame together either vertically, or stitches horizontally after aligning on index
2. .merge() first aligns two DataFrame' selected common column(s) or index, and then pick up the remaining columns from the aligned rows of each DataFrame

Do you know about join function? This interesting quest we give to you to find.

Select the part of the dataframe such that it contains cities where temp is less then or equal to 20 <br>
How many cities are there?

<p style='text-align: right;'> 5+5=10 points</p>

In [40]:
d3[d3["Temprature"] <= 20]

         city  Temprature
0  Chandigarh          15
2      Kanpur          20
4      Manali          -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [41]:
d3[d3['Temprature'] >= 35 ]

          city  Temprature
1   Coimbatore          35
2    Srirangam          36
3  Pondicherry          39

## 3. Applying functions to columns and creating new columns

Reference: https://youtu.be/MxSHDIxm6JA

<p style='text-align: right;'> 20 points</p>

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [42]:
# write function here
d3["is_ut"] = (d3['city'] =='Chandigarh') | (d3['city'] =='Delhi') |(d3['city'] =='Pondicherry')

In [43]:
#print d3
d3

          city  Temprature  is_ut
0   Chandigarh          15   True
1        Delhi          22   True
2       Kanpur          20  False
3      Channai          26  False
4       Manali          -2  False
0     Banglaru          24  False
1   Coimbatore          35  False
2    Srirangam          36  False
3  Pondicherry          39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [54]:
# write function here
def c_to_f(x) :
    return (x * 1.8) + 32

In [55]:
# check  function c_to_f(10)
c_to_f(10)

50.0

In [59]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['temp_farenhiet'] = d3['Temprature'].apply([c_to_f])
d3

          city  Temprature  is_ut  temp_farenhiet
0   Chandigarh          15   True            59.0
1        Delhi          22   True            71.6
2       Kanpur          20  False            68.0
3      Channai          26  False            78.8
4       Manali          -2  False            28.4
0     Banglaru          24  False            75.2
1   Coimbatore          35  False            95.0
2    Srirangam          36  False            96.8
3  Pondicherry          39   True           102.2

## 4. Indexing and selecting rows in DataFrame

Reference:-https://youtu.be/TB0pXxTyH6g

<p style='text-align: right;'> 20 points</p>

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [79]:

d3.index = ['a','b','c','d','e','f','g','e','h']
d3.loc[['a','b','h']]

          city  Temprature  is_ut  temp_farenhiet
a   Chandigarh          15   True            59.0
b        Delhi          22   True            71.6
h  Pondicherry          39   True           102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [83]:
d3[d3['temp_farenhiet'] >90]

          city  Temprature  is_ut  temp_farenhiet
g   Coimbatore          35  False            95.0
e    Srirangam          36  False            96.8
h  Pondicherry          39   True           102.2

Select only the first three rows of the dataframe d1.

In [86]:
d1.iloc[:3]

         city  Temprature
0  Chandigarh          15
1       Delhi          22
2      Kanpur          20

Select all the rows and last two columns in the dataframe.

In [90]:
d3.iloc[:,2:]

   is_ut  temp_farenhiet
a   True            59.0
b   True            71.6
c  False            68.0
d  False            78.8
e  False            28.4
f  False            75.2
g  False            95.0
e  False            96.8
h   True           102.2

## 5. Reading csv file and group by

Reference: https://youtu.be/e22QpyC_bYo <br>
https://youtu.be/Qm2ohA-f3fU

<p style='text-align: right;'> 2*2=4 points</p>

Read the file 'weather_data.csv' and store it in a pandas dataframe 'df'

In [98]:
df = pd.read_csv('weather_data.csv')

In [99]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

print the shape and head of the dataframe

In [100]:
print(df.shape)
print(df.head())

(6, 4)
        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

Group the dataframe wrt to 'event' and save the resulting output in a variable named 'g'

<p style='text-align: right;'> 5*3 = 15 points</p>

In [101]:
g=df.groupby('event')

Print g and  type(g)

In [102]:
print(g)
print(type(g))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001BA84A75DE0>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Iterate over all the temperatures in g and print them

In [109]:
for i in g :
    print(i)

('Rain',         day  temperature  windspeed event  Hot_temp
0  1/1/2017           32          6  Rain      True
4  1/5/2017           32          4  Rain      True)
('Snow',         day  temperature  windspeed event  Hot_temp
2  1/3/2017           28          2  Snow     False
3  1/4/2017           24          7  Snow     False)
('Sunny',         day  temperature  windspeed  event  Hot_temp
1  1/2/2017           35          7  Sunny      True
5  1/6/2017           31          2  Sunny      True)

Use the describle method on g to get the complete description on it.

In [104]:
g.describe()

      temperature                                               windspeed  \
            count  mean       std   min   25%   50%   75%   max     count
event
Rain          2.0  32.0  0.000000  32.0  32.0  32.0  32.0  32.0       2.0
Snow          2.0  26.0  2.828427  24.0  25.0  26.0  27.0  28.0       2.0
Sunny         2.0  33.0  2.828427  31.0  32.0  33.0  34.0  35.0       2.0


      mean       std  min   25%  50%   75%  max
event
Rain   5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

Create a new column in the dataframe df, named 'hot_temp' which contains True if temp is above 30, else False

<p style='text-align: right;'> 5 points</p>

In [107]:
#code here to filter df with above condition
df['Hot_temp'] = df['temperature'] > 30

In [108]:
# print df
print(df)

        day  temperature  windspeed  event  Hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

## Data Range

Reference:-https://youtu.be/_gcJfwKElxs

<p style='text-align: right;'> 5*3 = 15 points</p>

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [116]:
a= pd.date_range(start='2020-1-1 00:00:00',end='2020-4-1',freq='D')

print a

In [117]:
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20',
               '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24',
               '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-01',
               '2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05',
               '2020-02-06', '2020-02-07', '2020-02-08', '2020-02-09',
               '2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-15', '2020-02-16', '2020-02-17',
               '2020-02-18', '2020-02-19', '2020-02-20', '2020-02-21',
               '2020-02-22', '2020-02-23', '2020-02-24', '2020-02-25',
               '2020-02-26', '2020-02-27', '2020-02-28', '2020-02-29',
               '2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06', '2020-03-07', '2020-03-08',
               '2020-03-09', '2020-03-10', '2020-03-11', '2020-03-12',
               '2020-03-13', '2020-03-14', '2020-03-15', '2020-03-16',
               '2020-03-17', '2020-03-18', '2020-03-19', '2020-03-20',
               '2020-03-21', '2020-03-22', '2020-03-23', '2020-03-24',
               '2020-03-25', '2020-03-26', '2020-03-27', '2020-03-28',
               '2020-03-29', '2020-03-30', '2020-03-31', '2020-04-01'],
              dtype='datetime64[ns]', freq='D')

What is the len of a?

In [118]:
print(len(a))

92

What is the type of a?

In [119]:
print(type(a))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

________________
# Hey high five! You solved the 4th milestone challenge too! Pawri to banti hai ;)
________________